In [2]:
import numpy as np

import pandas as pd

In [3]:
from pandas import Series, DataFrame

# Introduction to pandas Data Structures

## Series

In [4]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [18]:
obj2['b']

np.int64(7)

In [20]:
obj2[['b','d','c']]

b    7
d    4
c    3
dtype: int64

In [21]:
obj2[obj2>1]

d    4
b    7
c    3
dtype: int64

In [24]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [25]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [26]:
'b' in obj2

True

In [27]:
'z' in obj2

False

In [28]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [31]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [34]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [38]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [39]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [42]:
obj4.name = 'population'

In [44]:
obj4.index.name = 'state'

In [45]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [46]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [47]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [48]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [50]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [51]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [53]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
pd.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [61]:
frame2 = pd.DataFrame(data,columns = ['year','state','pop','debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [62]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [63]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [65]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [66]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [67]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [69]:
frame2['debt']=16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [76]:
frame2['debt']=np.arange(6)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [77]:
val = pd.Series([-1.2,-1.5,-1.7],index = [2,4,5])

In [79]:
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [84]:
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [85]:
del frame2['eastern']
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [88]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [89]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
                   "Nevada": {2001: 2.4, 2002: 2.9}}

In [91]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [92]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [101]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [102]:
pdata = {"Ohio": frame3["Ohio"][:-1],
             "Nevada": frame3["Nevada"][:2]}

In [103]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [105]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [106]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [108]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

## Index Objects

In [111]:
obj = pd.Series(np.arange(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [112]:
index[1:]

Index(['b', 'c'], dtype='object')

In [115]:
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int64')

In [117]:
obj2 = pd.Series([1.5,2.5,0],index=labels)
obj2

0    1.5
1    2.5
2    0.0
dtype: float64

In [118]:
obj2.index is labels

True

In [122]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [123]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [124]:
'Ohio' in frame3.columns

True

In [125]:
2003 in frame3.index

False

In [127]:
2002 in frame3.index

True

In [128]:
#pandas Index can contain duplicate labels
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Possible data inputs to the DataFrame constructor

                    Possible data inputs to the DataFrame constructor
|Type|Notes|
|---|---|
|2D ndarray	|A matrix of data, passing optional row and column labels|
|Dictionary of arrays, lists, or tuples	|Each sequence becomes a column in the DataFrame; all sequences must be the same length|
|NumPy structured/record array	|Treated as the dictionary of arrays case|
|Dictionary of Series	|Each value becomes a column; indexes from each Series are unioned together to form the results row index if no explicit index is passed|
|Dictionary of dictionaries	|Each inner dictionary becomes a column; keys are unioned to form the row index as in the dictionary of Series case|
|List of dictionaries or Series	|Each item becomes a row in the DataFrame; unions of dictionary keys or Series indexes become the DataFrames column labels|
|List of lists or tuples	|Treated as the 2D ndarray case|
|Another DataFrame	|The DataFrames indexes are used unless different ones are passed|
|NumPy MaskedArray	|Like the 2D ndarray case except masked values are missing in the DataFrame result|

## Some Index methods and properties

|Method/Property 	|Description|
|--|--|
|append()	|Concatenate with additional Index objects, producing a new Index Index  Index|
|difference()	|Compute set difference as an Index   |
|intersection()	|Compute set intersection |
|union()	|Compute set union |
|isin()	|Compute Boolean array indicating whether each value is contained in the passed collection  |
|delete()	|Compute new Index with element at Index i deleted i |
|drop()	|Compute new Index by deleting passed values  |
|insert()	|Compute new Index by inserting element at Index i   i |
|is_monotonic	|Returns True if each element is greater than or equal to the previous element   True|
|is_unique	|Returns True if the Index has no duplicate values   True|
|unique()	|Compute the array of unique values in the Index  |

# Essential Functionality

## Reindexing

In [131]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [132]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [134]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [135]:
obj3.reindex(np.arange(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [136]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                        index=["a", "c", "d"],
                        columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [138]:
frame2 = frame.reindex(index = ['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [140]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [143]:
frame.reindex(states, axis='columns')

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [144]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

## Dropping Entries from an Axis

In [146]:
obj = pd.Series(np.arange(5),index = ["a", "b", "c", "d", "e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [148]:
newobj = obj.drop('c')
newobj

a    0
b    1
d    3
e    4
dtype: int64

In [149]:
obj.drop(['c','d'])

a    0
b    1
e    4
dtype: int64

In [152]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ["Ohio", "Colorado", "Utah", "New York"], 
                    columns = ["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data.drop(index = ['Ohio','Colorado'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [157]:
data.drop(columns = ['two'])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [161]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [163]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## Indexing, Selection, and Filtering

In [166]:
obj = pd.Series(np.arange(4),index = ["a", "b", "c", "d"])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [167]:
obj['b']

np.int64(1)

In [180]:
obj.iloc[1]

np.int64(1)

In [178]:
obj[2:4]

c    2
d    3
dtype: int64

In [173]:
obj[['b','a','d',]]

b    1
a    0
d    3
dtype: int64

In [182]:
obj[[1,3]]

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_88319/1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1
d    3
dtype: int64

In [184]:
obj[obj<2]

a    0
b    1
dtype: int64

In [185]:
#preferred
obj.loc[["b", "a", "d"]]

b    1
a    0
d    3
dtype: int64

In [186]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj1

2    1
0    2
1    3
dtype: int64

In [187]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj2

a    1
b    2
c    3
dtype: int64

In [188]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [189]:
obj2[[0,1,2]]

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_88319/2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [194]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [199]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [200]:
obj1.loc[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [201]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [203]:
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [204]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                       index=["Ohio", "Colorado", "Utah", "New York"],
                       columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [205]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [206]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [207]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [209]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [210]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [211]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection on DataFrame with loc and iloc

In [212]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [213]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [214]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [216]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [217]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [218]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [219]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [220]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [221]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [222]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Integer indexing pitfalls

In [229]:
ser = pd.Series(np.arange(3))

In [230]:
ser.iloc[-1]

np.int64(2)

In [224]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [225]:
ser2[-1]

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_88319/811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

np.float64(2.0)

In [228]:
ser[:2]

0    0
1    1
dtype: int64

## Pitfalls with chained indexing

In [231]:
#we can assign to a column or row by label or integer position
data.loc[:,'one'] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [232]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [234]:
data.loc['Utah']

one      5
two      5
three    5
four     5
Name: Utah, dtype: int64

In [238]:
data.loc[data['four']>5] =3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [239]:
# rewrite the chained 
data.loc[data.three ==5, 'three']=6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

## Arithmetic and Data Alignment

In [244]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [245]:
s2 = pd.Series([2.1,3.6,-1.5,4,3.1],index = ['a','c','e','f','g'])
s2

a    2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [246]:
s1+s2

a    9.4
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [250]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),columns = list('bcd'),index = ['Ohio','Texas','Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [251]:
df2 =pd.DataFrame(np.arange(12).reshape((4,3)),columns = list('bde'),index = ['Utah','Ohio','Texas','Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [252]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [253]:
df1 = pd.DataFrame({'A':[1,2]})
df1

   A
0  1
1  2

In [254]:
df2 = pd.DataFrame({'B':[3,4]})
df2

   B
0  3
1  4

In [255]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

## Arithmetic methods with fill values

In [256]:
df1 = pd.DataFrame(np.arange(12).reshape((3,4)),columns = list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [258]:
df2 = pd.DataFrame(np.arange(20).reshape((4,5)),columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [259]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [260]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [261]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [262]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [264]:
df1.reindex(columns = df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

## Operations between DataFrame and Series

In [266]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [267]:
arr[0]

array([0, 1, 2, 3])

In [268]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [269]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                     columns = list('bde'),
                     index = ["Utah", "Ohio", "Texas", "Oregon"])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [271]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int64

In [273]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [274]:
series2 = pd.Series(np.arange(3),index = ['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [275]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [276]:
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int64

In [280]:
frame.sub(series3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [281]:
frame = pd.DataFrame(np.random.standard_normal((4,3)),
                     columns = list('bde'),
                     index = ["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    0.397886 -0.096107  0.250460
Ohio    0.840747 -1.189529 -1.870877
Texas   0.035470  0.514410 -0.817270
Oregon  0.947617  2.088143  1.099136

In [282]:
np.abs(frame)

               b         d         e
Utah    0.397886  0.096107  0.250460
Ohio    0.840747  1.189529  1.870877
Texas   0.035470  0.514410  0.817270
Oregon  0.947617  2.088143  1.099136

In [283]:
def f1(x):
    return x.max()-x.min()

frame.apply(f1)

b    0.912147
d    3.277672
e    2.970014
dtype: float64

In [284]:
frame.apply(f1,axis = 'columns')

Utah      0.493993
Ohio      2.711625
Texas     1.331680
Oregon    1.140527
dtype: float64

In [286]:
def f2(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])

frame.apply(f2)

            b         d         e
min  0.035470 -1.189529 -1.870877
max  0.947617  2.088143  1.099136

In [287]:
def my_format(x):
    return f'{x:.2f}'

frame.applymap(my_format)

/var/folders/zm/d0465cgn1zvdzj96xmp0pxww0000gp/T/ipykernel_88319/4113676589.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

           b      d      e
Utah    0.40  -0.10   0.25
Ohio    0.84  -1.19  -1.87
Texas   0.04   0.51  -0.82
Oregon  0.95   2.09   1.10

In [288]:
frame['e'].map(my_format)

Utah       0.25
Ohio      -1.87
Texas     -0.82
Oregon     1.10
Name: e, dtype: object

## Sorting and Ranking

In [289]:
obj = pd.Series(np.arange(4),index = ["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [290]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [291]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                     index = ['three', 'one'],
                     columns= ["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [292]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [294]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [295]:
frame.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [296]:
obj = pd.Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [297]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [298]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [299]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [300]:
obj.sort_values(na_position = 'first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [302]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [303]:
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [304]:
frame.sort_values(['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [305]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [306]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [307]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [308]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [309]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [310]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [311]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [312]:
obj.index.is_unique

False

In [313]:
obj['a']

a    0
a    1
dtype: int64

In [314]:
obj['c']

np.int64(4)

In [315]:
df = pd.DataFrame(np.random.standard_normal((5,3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a  0.501911 -0.091680 -0.957337
a -0.718265  0.352824 -1.118200
b -0.714218 -1.121069  0.402574
b -0.592849 -0.448056 -0.856725
c  0.501877 -0.559989 -0.415752

In [316]:
df.loc['b']

          0         1         2
b -0.714218 -1.121069  0.402574
b -0.592849 -0.448056 -0.856725

In [317]:
df.loc['c']

0    0.501877
1   -0.559989
2   -0.415752
Name: c, dtype: float64

## reindex function arguments

|Argument	|Description|
|---|---|
|labels	|New sequence to use as an index. Can be Index instance or any other sequence-like Python data structure. An Index will be used exactly as is without any copying.
|| Index  Python |
|index	|Use the passed sequence as the new index labels.
|||
|columns	|Use the passed sequence as the new column labels.
|||
|axis	|The axis to reindex, whether "index" (rows) or "columns". The default is "index". You can alternately do reindex(index=new_labels) or reindex(columns=new_labels).
||index reindexindex=new_labels  reindexcolumns=new_labels|
|method	|Interpolation (fill) method; "ffill" fills forward, while "bfill" fills backward.
||;ffillbfill|
|fill_value	|Substitute value to use when introducing missing data by reindexing. Use fill_value="missing" (the default behavior) when you want absent labels to have null values in the result.
|| null  fill_value=missing|
|limit	|When forward filling or backfilling, the maximum size gap (in number of elements) to fill.
|||
|tolerance	|When forward filling or backfilling, the maximum size gap (in absolute numeric distance) to fill for inexact matches.
|||
|level	|Match simple Index on level of MultiIndex; otherwise select subset of.
||MultiIndex;|
|copy	|If True, always copy underlying data even if the new index is equivalent to the old index; if False, do not copy the data when the indexes are equivalent.
|| True; False|

## Indexing options with DataFrame

|Type	|Notes|
|---|---|
|df[column]	|Select single column or sequence of columns from the DataFrame; special case conveniences: Boolean array (filter rows), slice (slice rows), or Boolean DataFrame (set values based on some criterion)|
|| DataFrame ;slice Boolean DataFrame|
|df.loc[rows]	|Select single row or subset of rows from the DataFrame by label|
|| DataFrame |
|df.loc[:, cols]	|Select single column or subset of columns by label|
|||
|df.loc[rows, cols]	|Select both row(s) and column(s) by label|
|||
|df.iloc[rows]	|Select single row or subset of rows from the DataFrame by integer position|
|| DataFrame |
|df.iloc[:, cols]	|Select single column or subset of columns by integer position|
|||
|df.iloc[rows, cols]	|Select both row(s) and column(s) by integer position|
|||
|df.at[row, col]	|Select a single scalar value by row and column label|
|||
|df.iat[row, col]	|Select a single scalar value by row and column position (integers)|
|||
|reindex method	|Select either rows or columns by labels|
|||

## Flexible arithmetic methods

|Method	|Description|
|---|---|
|add, radd	|Methods for addition (+) |
|sub, rsub	|Methods for subtraction (-)|
|div, rdiv	|Methods for division (/) |
|floordiv, rfloordiv	|Methods for floor division (//)|
|mul, rmul	|Methods for multiplication (*)|
|pow, rpow	|Methods for exponentiation (**)|

## Tie-breaking methods with rank

|Method	|Description|
|---|---|
|"average"	|Default: assign the average rank to each entry in the equal group|
|||
|"min"	|Use the minimum rank for the whole group|
|||
|"max"	|Use the maximum rank for the whole group|
|||
|"first"	|Assign ranks in the order the values appear in the data|
|||
|"dense"	|Like method="min", but ranks always increase by 1 between groups rather than the number of equal elements in a group|
|| method=min 1|

# Summarizing and Computing Descriptive Statistic

In [318]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                   index=["a", "b", "c", "d"],
                   columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [319]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [320]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [321]:
df.sum(axis='index',skipna=False)

one   NaN
two   NaN
dtype: float64

In [322]:
df.sum(axis='columns',skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [323]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [327]:
df.idxmax()

one    b
two    d
dtype: object

In [328]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [329]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [330]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [331]:
#nonnumeric data, describe produces alternative summary statistics:
#describe 
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Options for reduction methods

|Method	|Description|
|---|---|
|axis	|Axis to reduce over; "index" for DataFrames rows and "columns" for columns|
||;indexcolumns|
|skipna	|Exclude missing values; True by default|
||; True|
|level	|Reduce grouped by level if the axis is hierarchically indexed (MultiIndex)|
|| MultiIndex|

## Descriptive and summary statistics

|Method	|Description|
|---|---|
|count	|Number of non-NA values|
|| NA |
|describe	|Compute set of summary statistics|
|||
|min, max	|Compute minimum and maximum values|
|||
|argmin, argmax	|Compute index locations (integers) at which minimum or maximum value is obtained, respectively; not available on DataFrame objects|
||; DataFrame |
|idxmin, idxmax	|Compute index labels at which minimum or maximum value is obtained, respectively|
|||
|quantile	|Compute sample quantile ranging from 0 to 1 (default: 0.5)|
|| 0  1 0.5|
|sum	|Sum of values|
|mean	|Mean of values|
|median	|Arithmetic median (50% quantile) of values|
|mad	|Mean absolute deviation from mean value|
|||
|prod	|Product of all values| 
|||
|var	|Sample variance of values|
|||
|std	|Sample standard deviation of values|
|||
|skew	|Sample skewness (third moment) of values|
|||
|kurt	|Sample kurtosis (fourth moment) of values|
|||
|cumsum	|Cumulative sum of values| 
|||
|cummin, cummax	|Cumulative minimum or maximum of values, respectively|
|||
|cumprod	|Cumulative product of values|
|||
|diff	|Compute first arithmetic difference (useful for time series)|
|||
|pct_change	|Compute percent changes| 
|||

##